#################
# Taps
#################
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

#################
# Brews
#################

# Langs
brew "node"
brew "python"

# Tooling
brew "git"
brew "yarn"
brew "neovim"
brew "fzf"
brew "gnu-sed"
brew "ripgrep"
brew "wget"

# Shell stuff
brew "fish"
brew "exa"

# Customization
brew "yabai"
brew "skhd"

#################
# Casks
#################
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "kitty"

#################
# MISC
# These are not necessary.
# I just like homebrew.
# Uncomment what you want/need
#################
# cask "notion"
# cask "visual-studio-code"
# cask "spotify"
# cask "google-chrome"
# cask "bitwarden"
# cask "displaylink"
